# 1) შექმენით 3 ელემენტიანი სახელების სია. მომხმარებელს შემოატანინეთ 0-დან 2-ის ჩათვლით ნებისმიერი რიცხვი, სანამ მომხმარებელი 
# არ შემოიტანს რიცხვს საჭირო დიაპაზონში, ხელახლა ვთხოვოთ რიცხვის შემოტანა.(გამოიყენეთ while loop-ი)
#დაბეჭდეთ სახელების სიაში მომხმარებლის მიერ შემოტანილ ინდექსზე მყოფი ელემენტი
names=["Gio","nika","Andria"]
num=int(input("Enter a number: "))
while num>2 or num<0:
    print("try again")
    num=int(input("Enter a number: "))

print(names[num])
#2) რატომ გამოიტანს ეს კოდი შეცდომას?

word = "Python"
#word[0] = "B"
print(word)

#ახსენით კომენტარით
# აქ არის შეცდომა რადგან string არის immutable და არ შეიძლება რომ შევცვალოთ

#3) შექმენით 10 ელემენტიანი რიცხვების სია და slicing-ის გამოყენებით დაბეჭდეთ ყოველი მესამე ელემენტი ამ სიაში

list=["Goa","is","best","nika","teachs","us","Good","gio","andria","zaza"]
print(list[::3])

#4) slicing-ის გამოყენებით. იგივე სიიდან დაბეჭდეთ მე-4, მე-7 და მე-10 ელემენტები

list=["Goa","is","best","nika","teachs","us","Good","gio","andria","zaza"]
print(list[3::3])