#1) შექმენით 5 ელემენტიანი სია, სადაც ჩაწერთ თქვენს საყვარელი მანქანების სახელს

cars=["bmw","lamborghini","buggati","porche","mercedes"]
print(cars)

#2) შექმენით რიცხვების სია, სადაც ჩაწერთ 0-დამ 10-ის ჩათვლით ყველა ლუწ რიცხვს

nums=[0,1,2,3,4,5,6,7,8,9,10]
print(nums)

#3) შექმენით 5 ელემენტიანი სია და დაბეჭდეთ მისი მე-4 ელემენტი

list=["banana","goa","nika","apple","box"]
print(list[3])

#4) იგივე სიის მე-3 ინდექსზე მყოფი ელემენტი შეცვალეთ თქვენი სახელით და დაბეჭდეთ მთლიანი სია.

list=["banana","goa","nika","apple","box"]
list[3]="gio"
print(list)

#5) შექმენით 3 ელემენტიანი რიცხვების სია და დაბეჭდეთ პირველი და ბოლო ელემენტთა ჯამი

nums=[123,932,555]
print(nums[0]+nums[2])