#1) შექმენით 5 ელემენტიანი სია. for ციკლის მეშვეობით მომხმარებელს შემოატანინეთ კიდევ 5 რიცხვი და თითოეული შემოტანილი რიცხვი 
# .append ფუნქციის მეშვეობით ჩაამატეთ არსებულ სიაში. საბოლოოდ დაბეჭდეთ ეს სია

names=["andria","nika","jan","data","tornike"]
for i in range(0,5):
    names.append(int(input("Enter a number: ")))
print(names)

#2) იგივე სიაში მე-3 და მე-4 ელემენტებს შორის ჩასვით თქვენი სახელი. მე-5 ჩაამატეთ თქვენი ასაკი. სიის თავში ჩაამატეთ თქვენი სიმაღლე. 
# სიის ბოლოში კი თქვემი საყვარელი რიცხვი

names.insert(2,"Gio")
names.insert(5,"13")
names.insert(0, "160cm")
names.append(10)
print(names)