#1) განიხილეთ ეს კოდი (რას გამოიტანს):

name="vano"
age=0
#print(name+ "best")
# ეს კოდი არაფერს არ დაბეჭდავს რადგან print(name + "best") დაკომენტარებულია და პროგრამა ამას აიგნორებს

#----------------------------------------------------
#კომენტარის გამოყენებით ახსენით რა არის კომენტარი + რისთვის გამოიყენება ის ასევე ახსენით რა არის დებაგინგი
#კომენტარი არის ადამიანებისთვის მარტივად აღქმისთვის გამოყენებული ხერხი და debugging არის რაღაცის შესწორება (გამართვა)
#----------------------------------------------------
#რა არის ამ კოდში შეცდომა (რომელ ხაზზე)
name="vano"
surname=motiashvili
height=1 86
print(name+surname-height)
#პირველი შეცდომა არის მეორე ხაზში რადგან motiashvili უნდა იყოს ბრჭყალებში რადგან ის არის ტექსტური მონაცემი (string)
#მეორე შეცდომა არის მესამე ხაზში რადგან ციფრები არიან დაშორებული და ასევე ჩვენ integer ტიპის ცვლადს გადავცემთ მხოლოდ ერთ ცვლადს
#და ასევე შეცდომა არის მეოთხე ხაზში რადგან ჩვენ string ტიპის ცვლადს ვერ გამოვაკლებთ integer ტიპის ცვლადს