#2) კომენტარებით ახსენით თუ რა არის custom ფუნქციები, რისთვის გამოვიყენებთ და რა დანიშნულება გააჩნიათ, ასევე ახსენით მისი შექმნის 
# გზები ეტაპობრივად და ახსენეთ თუ რაა პარამეტრები და არგუმენტები.

# custom ფუნქციები არის ისეთი ფუნქციები რომლებსაც ვქმნით ჩვენ და ვუწერთ მას დავალებას თუ რას გააკეთებს ის custom ფუნქციებს გამოიყენებენ
# იმისთვი რომ გადაჭრან რაღაც პრობლემები და ცოტა შეამოკლოან კოდი

# შექმნის გზა:
# 1. custom ფუნქციის შესაქმნელად საჭიროა def keyword
# 2.შემდგომ ჩვენ ფუნქციას უნდა მოვუფიქროთ სახელი 
# 3.ვწერთ ბრჩხილებს და შემდგომ ორწერტილს რომ დავიწყოთ ფუნქციის block დაწერა
# 4.ჩვენ შეგვიძლია დავწეროთ ფუნქციის შექმნის დროს ბრჩხილებში ერთი ან მეტი პარამეტრი ასევე შეიძლება 0 იც გადაეცეს
# 5.როცა გვინდა გამოვიძახოთ ფუნქცია ვწერთ ფუნქციის სახელს და შემდეგ ბრჩხილებს (თუ პარამეტრი ეწერა ფუნქციის შექმნისას ბრჩხილებში მაშინ
# გამოძახებისას ფრჩხილებში უნდა ჩავწეროთ არგუმენტი თუ წერია 2 პარამეტრი მაშინ უნდა ჩავწეროთ ბრჩხოლებში 2 არგუმენტი)