# არგუმენტი არის ისეთი რიცხვები რომლებიც მოთავსებულია range ფუნქციის ფრჩხილებში და უთითებს მას თუ საიდან სადამდე და რამდენი რიცხვის გამოტოვებით 
# დაწეროს რიცხვები range ფუნქცია წერს რიცხვებს მითითებული არგუმენტების მიხედვით თუ range ფუნქციას გადაეცემა 1 არგუმენტი მაშინ range ფუნქცია
# იწერს რიცხვების წერას 0 იდან ამ მითითებულ არგუმენტამდე თუ ფუნქციას გადაეცემა 2 არგუმენტი მაშინ ფუნქცია იწყებს რიცხვების წერას I ადგილას
# მდგომი არგუმენტიდან და ასე აგრძელებს II ადგილასმყოფ რიცხვამდე თუ ფუნქციას გადაეცემა 3 არგუმენტი მაშინ ფუნქცია იწყებს რიცხვების დაწერას 
# I ადგილას მდგომი არგუმენტიდან და ასე აგრძელებს II ადგილასმყოფ რიცხვამდე ოღონდ წერს მეიმდენე რიცხვს თუ რა რიცხვიც წერია III ადგილას
