#1) შექმენით 5 ელემენტიანი სია. გადაუარეთ მას for ციკლით და დაბეჭდეთ მისი თითოეული ელემენტი

cars=["buggati","lamborghini","mercedes","bmw","ferrari"]
for i in cars:
    print(i)

#2) შექმენით ცვლადი სადაც შეინახავთ ნებისმიერ წინადადებას. გადაუარეთ for ციკლით მას და დაბეჭდეთ წინადადების თითოეული სიმბოლო

name="GOA is best"
for i in name:
    print(i)

#3) პირველ დავალებაში შექმნილ სიას გადაუარეთ while ციკლის გამოყენებით.(მინიშნება: დაგჭირდებათ ცვლადის შექმნა, რომელსაც 
#გაზრდით და გამოიყენებთ მას რომ მიიღოთ წვდომა სიის ინდექსებზე)

cars=["buggati","lamborghini","mercedes","bmw","ferrari"]
num=0
while num<5:
    print(cars[num])
    num=num+1

#შევქმენით რაღაც ცვლადის რომელსაც მივანიჭეთ მნიშვნელობა 0 რადგანაც ინდექსების ათვლა იწყება 0 იდან შემდგომ while ში გავწერეთ ისეთ რაღაც 
#რომლის მეშვეობითაც ჩვენ გავჩერდებით იმ რიცხვამდე სადამდეც ჩვენ გვინდა ანუ იმ ინდექსამდე რომელიც უკვე გასცდება ლისტში 
#მითითებულ მაქსიმალურ ინდექსს print(cars[num]) გვაძლევს წვდომას cars სიის ინდექსებზე ანუ თავიდან num=0 შესაბამისად პირველად დაიბეჭდება
#სიის მენულე ინდექსზე მდგომი ელემენტი ქვემოთ კი ჩვენ ვზრდით ამ num ს ერთით რადგან მივიღოთ წვდომა სიის შემდეგ ინდექსზე მყოფ ელემენტზე
#რადგანც ჩენ გვინდა მთლიან ლისტს რომ გადავუაროთ ყოველ ასეთ გამეორებაზე ჩვენ ვიღებთ წვდომას სულ შემდეგ და შემდეგ ინდექსებზე 
#და ციკლი გაჩერდება სიის ბოლო ინდექსზე მყოფ ელემენტამდე